app/controllers/lab_reports_controller.rb

SELECT "lab_reports".* FROM "lab_reports"
---
  def index
    @lab_reports = LabReport.all

INSERT INTO "lab_reports" ("user_id", "title", "description", "grade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["title", "Math"], ["description", "Test1"], ["grade", "A"], ["created_at", "2024-07-19 07:52:42.225026"], ["updated_at", "2024-07-19 07:52:42.225026"]]
---
  def create
    @lab_report = LabReport.new(lab_report_params)

    respond_to do |format|
      if @lab_report.save

UPDATE "lab_reports" SET "description" = ?, "updated_at" = ? WHERE "lab_reports"."id" = ?  [["description", "Test2"], ["updated_at", "2024-07-19 07:53:58.400992"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @lab_report.update(lab_report_params)

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_lab_report
    @lab_report = LabReport.find(params[:id])