app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["first_name", "Maksim"], ["last_name", "Si"], ["email", "[FILTERED]"], ["created_at", "2024-07-19 07:35:31.074317"], ["updated_at", "2024-07-19 07:35:31.074317"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Siy"], ["updated_at", "2024-07-19 07:35:38.012112"], ["id", 1]]